add mermaid
